# Задача 4. Есть ли статистически значимые различия в росте дочерей?

# Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
# Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160, 163


import numpy as np
from scipy import stats

x_m = np.array([172, 177, 158, 170, 178, 175, 164, 160, 169])
x_d = np.array([173, 175, 162, 174, 175, 168, 155, 170, 160])

ttest = stats.ttest_rel(x_m, x_d)

print(ttest)

# pvalue > alpha: статистически значимых различий не обнаружено при alpha = 0.05